export interface PastLife {
  name: string;
  description: string;
}

// Ключ - это строка из трех чисел через дефис, например "9-15-6"
export const PAST_LIVES: Record<string, PastLife> = {
  "9-15-6": {
    name: "Воин",
    description: `В прошлом воплощении Вы были воином, человеком, который участвовал в военных действиях, в борьбе. От Ваших решений зависели жизни других людей. Очевидно, что вы совершали убийства. Могли и сами погибнуть на войне.

С чем пришел в эту жизнь: Вы - обладатель агрессивного и воинственного характер с желанием конкурировать, бороться, побеждать.
Вы часто спорите, иногда спорите, что бы просто поспорить. Для Вас принципиально важно, чтобы последнее слово осталось за Вами. Часто копите в себе агрессию, а потом выплескиваете её на близких людей.
Стремитесь к успеху. Беретесь делать одновременно много дел. Достаточно жёстко реагируете на мнения, с которыми не согласны, часто «продавливаете» других людей, у которых не такое мнение, как у Вас. Не любите никому подчиняться. Для Вас подчиниться, значит проявить слабость. Всем пытаетесь что-то доказать. Вам всегда надо быть успешным, первым, лучшим.
Но в постоянной борьбе Вам рано или поздно становится сложно, Вы выматываетесь, начинаете делать ошибки, энергетически опустошаетесь.
Ваша чрезмерная агрессивность начнёт блокировать продвижение вперёд и социальную реализацию. За любое проявление агрессии будет следовать наказание. Воины в большинстве своем отлично стреляют, хорошо обращаются с оружием. Боятся поначалу сесть за руль, но потом обожают ощущение скорости.

Как происходит развитие души:
Научитесь не вступать в конфликты, озвучивайте все свои претензии спокойно без агрессии. Перестаньте постоянно спорить, просто выскажите своё мнение. Научитесь разбираться в себе, а не агрессировать в сторону другого человека. Прислушивайтесь к мнению других людей, пытайтесь понять их.
Откажитесь от борьбы и постепенно все станет налаживаться: появится новый взгляд на прощение; будете легко уходить от конфликтных ситуаций; осознаете, что ресурсов достаточно и нужно ставить цели и не бороться, а просто допустить, что всему свое время.
Созидание, сотрудничество и любовь приносят намного больше плодов, чем соперничество и война.`
  },
  "3-7-22": {
    name: "Узник",
    description: `В прошлой жизни Человек был в заточении. Был в плену или в тюрьме. Возможно там умер.
Были возможны зависимости от алкоголя, еды, наркотиков, азартных игр. Или был в плену у партнера (многоженство, роковая женщина, муж тиран)
Так же могла быть несвобода по состоянию здоровья.

С чем пришел в эту жизнь: Нахождение в золотой клетке. Желание ощутить свободу.
Скорее всего в окружении присутствуют сидевшие. Человек мог быть очень ревнивым и перенести качество в это воплощение. Выбирает деятельность близкую к этой теме - адвокаты, прокуроры, судьи, надзиратели и тд.

Проработка кармы: Осознать, что можно быть свободным в любых условиях. Достойно пройти такие испытания, не дать сломить свой дух. Помогать другим, обрести свободу или не попасть в тюрьму.`
  },
  "3-13-10": {
    name: "Суицид",
    description: `В прошлом воплощении</strong><br>У вас был добровольный отказ от жизни. Это очень редкая карма.

    С чем пришел в эту жизнь: С самого детства есть склонность к экстриму, ситуации происходят всегда на грани (вы не дорожите свое жизнью и это пугает родных и близких людей)
Как происходит развитие души:
Нужно научиться ценить жизнь. Проживать эту жизнь не прошлом, не в фантазиях, а здесь и сейчас.
Забота о своей жизни, так же поможет облегчить жизнь вашим родным и близким.  `
    },
    "3-22-19": {
    name: "Дитя",
    description: `В прошлом воплощении:</strong><br>В прошлом воплощении был ранней уход из жизни, добровольный отказ в возрасте до 8 лет. Родители не смогли уберечь своего ребёнка и он погиб при нелепых обстоятельствах. Это очень редкая карма.

С чем пришел в эту жизнь: Душа пришла с обидой на самого близкого человека, на свою маму. Всю жизнь ищет свою маму (образно). С ней довольно сложные отношения, возможно так складываются обстоятельства. Есть чувство, что нужно все успеть, очень торопиться жить, хочется быстро закончить школу и получить образования и найти работу.

Как происходит развитие души: Прожить второе детство. Наиграться с племянниками, со своими детками, выбрать профессию связанную с детьми. Нужно понять женщин, которые делают аборт и простить их мысленно.`
    },
    "6-5-17": {
    name: "Гордыня",
    description: `В прошлом воплощении Вы были очень талантливы, обладали особенными качествами и чертами характера. Из-за этого и возгордились, считали себя лучше других и часто смотрели на людей с верху вниз.

С чем пришел в эту жизнь: В этой жизни, у вас есть стремление получить все просто так, по праву рождения. У вас есть и талант и хорошая внешность. Хочется получить все и сразу по максимуму, если это работа то сразу в начальники (на должность по блату на хорошее место). Имейте ввиду, что избрав такой путь продвижения по карьерной лестнице, вам придется пройти ситуации унижения (коллеги будут издеваться, начальство станет принижать). Если гордыня не будет исцелена - начнутся уроки (унижения).

Как происходит развитие души: Исцелить гордыню можно только при правильно подходе, это значит, что нужно идти к своей цели шаг за шагом, учиться добиваться результата своим трудом (желательно с самого детства). Относится с уважением и не считать других людей ничтожными.
И только тогда в вас сможет раскрыться звезда. Действовать медленно, интуитивно это будет ваш лучший подход. Время и труд это ваши лучше друзья.`
    },
    "6-8-20": {
    name: "Разочарование рода",
    description: `В прошлом воплощении Вы опозорили свой род проиграли ваше имущество в карты , опозорили свою честь, женились не по статусу, не оправдали надежды главы семьи и т.д. К примеру, в прошлой реинкарнации вы могли раскулачивать односельчан, забирали у них все ими нажитое непосильным трудом. Теперь воплотились в роду, в котором раскулачены предки, и на уровне подсознания на вас влияет родовая программа: «деньги-зло», «иметь деньги-опасно».

    С чем пришел в эту жизнь: Вы воплотились в том же роду. В прошлой жизни, стремления к большим деньгам принесли вам лишь страдания и теперь у вас есть материальные трудности. Как только деньги попадают в руки (заработали), то сразу появляется желание активно от них избавиться (потратить). Также у вас есть огромный набор талантов, есть четкое стремление быть лучшим, пытаетесь найти себя во многих направлениях. Ваши родные возлагают на вас большие надежды, и могут придираться. Вы пытаетесь учится, расти и побеждать но ваша мать все еще разочаровывается. Разочарования матери это ваш главный мотиватор, вы будете пытаться пока не угодите.<br>

Как происходит развитие души: Ваша задача в этом воплощении - прославить свой род! Твердо и ясно, вы должны отыграть в этой жизни все, что потеряли в прошлой. Это даст вам цель на всю жизнь, вас будут ставить в пример. Вы станете гордостью своего рода, если сможете добиться высокого результата.`
    },
    "6-14-8": {
    name: "Диктатор",
    description: `В прошлом воплощении Вы были диктатором. Это мало изученная карма (новая карма). Скорее всего, вы любили власть и подчинять себе мнения остальных, плохо относились к женщинам.

С чем пришел в эту жизнь: У вас мощная энергетика и сильное физическое тело. Но зачастую проживаете серой жизнью, работайте на заводе, конторе и т.п. Ваша работа вас не устраивает, но вы нечего не делайте с этим.

Как происходит развитие души: Нужно будет проявить себя через добро и помощь людям. Никого не винить в ваших бедах, а их будет немало.`
    },
    "6-17-11": {
    name: "Загубленный талант",
    description: `В прошлом воплощении Человек был наделен творческими талантами. Этот талант мог сделать его не только успешным финансово, но и полезным людям.
Однако по каким-то причинам человек не реализовал его.
Не успел, забоялся, не смог, выбрал обычную жизнь, физический труд. Возможно «зазвездился» и переоценил себя.

С чем пришел в эту жизнь: В настоящей жизни вам снова даётся такое испытание. В этом воплощении вы также наделены талантом, но работаете на обычной работе (возможно связана с деньгами: бухгалтер, экономист, менеджер). Когда поступали, родители сказали – этим ты всегда заработаешь на кусок хлеба. Вам очень сложно услышать себя. Вы все время ищете, пробуете учиться, хотите заняться чем-то особенным, однако вас все время отвлекают обстоятельства, искушения. И снова откладывается поиск себя на потом, не делая выбор в сторону своего предназначения. Вы словно компенсируете свой прошлый трудоголизм и часто отказываетесь работать в полную силу и максимально экономите энергию. Когда становитесь родителем – пытаетесь через детей исполнить мечту реализации таланта, водя их на разнообразные кружки и предоставляя множество возможностей для развития. Т.е. складываются обстоятельства, что вы можете открывать таланты в других людях, но не в себе.
При этом сами ведете скромный образ жизни.

Как проработать карму: Отказаться от обычной жизни, допустить, что талант есть! И поставить задачу найти себя. Стоит оставить детей в покое и дать им возможность прожить свою жизнь и беззаботное детство.
Вкладывайте больше времени и сил в свое саморазвитие. Время не ушло, если человек в возрасте (это наоборот вдохнет новый вкус к жизни). Сейчас жизненно важно понять в чем ваша особенность, талант и уйти от рутины. Реализоваться через весь свой творческий потенциал.<br> Не бояться светить и сиять на людях и создать нечто новое. Ответе себе честно на вопрос что вы любите? Туда и идите.`
    },
    "6-20-14": {
    name: "Душа, которую принесли в жертву",
    description: `В прошлом воплощении Вас использовали в качестве жертвоприношения. И люди глядя на процесс, пробуждались и понимали, что это все не правильно. (Редкая карма)

С чем пришел в эту жизнь: В этой жизни, ваше окружение теперь чувствует себя виноватыми перед вами, и отдают благо просто так, ни за что. Делают подарки и помогают чем только могут, вам не когда не отказывают в помощи и как правило, они сами предлагают помочь еще до того как вы попросите.

Как происходит развитие души: Для развития души, вам придется научиться довольствоваться малым, быть благодарным малому, не просить больше, чем положено. Вам нужно осознать, что в прошлом, ваша душа отдала свою жизнь ради благополучия других и теперь вам все мало, желаете заполучить все больше, не отдавая нечего взамен, как должное.`
    },
};
